# Pandas basic

### Assignment Questions

In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
data = [4, 8, 15, 16, 23, 42]

series = pd.Series(data)

In [6]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
data_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

series_list = pd.Series(data_list)

In [8]:
series_list

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
data3 = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

In [14]:
df = pd.DataFrame(data3)

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a 2-Dimensional labled data structure with column of potentially different types. It is similar to a spreadsheet or SQL table, where data is stored in rows and columns. Each column in a DataFrame is a Pandas Series.

A Pandas Series, is a one dimensional labeled array capable of holding any data type(integers,strings, floats etc.). It is like single column in DataFrame.

In [18]:
# Example of DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
# Example of Pandas Series
ages = pd.Series([25, 30, 27], name='Age')

ages

0    25
1    30
2    27
Name: Age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head() and tail(): These functions allow you to view the first or last few rows of the DataFrame

info(): Provides a summary of the 

describe(): Generates descriptive statistics (count, mean, standard deviation, min, max, etc.) for numerical columns in the DataFrame.

In [20]:
data4 = {
    'Product': ['A', 'B', 'A', 'C', 'B', 'C'],
    'Region': ['North', 'South', 'East', 'North', 'South', 'West'],
    'Sales': [100, 200, 150, 120, 180, 130]
}

df = pd.DataFrame(data4)


df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Product  6 non-null      object
 1   Region   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [22]:
df.head()

  Product Region  Sales
0       A  North    100
1       B  South    200
2       A   East    150
3       C  North    120
4       B  South    180

In [21]:
df.tail()

  Product Region  Sales
1       B  South    200
2       A   East    150
3       C  North    120
4       B  South    180
5       C   West    130

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame: It is mutable. You can modify the data in a DataFrame, such as changing values, adding or removing columns or rows.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [23]:
names = pd.Series(['Alice', 'Bob', 'Claire'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

In [25]:
df7 = pd.DataFrame({
    'Name': names,
    'Age': ages,
    'Gender': genders
})

In [26]:
df7

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female